@ewbankkit thanks for clarifying that.

The auto-import functionality was unclear to me, because when I ran `terraform plan` the output implied that Terraform would attempt to create the resource:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_subnet.default will be created
  + resource "aws_default_subnet" "default" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1f"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Given that the resource already existed, my next recourse was to try importing it, and that worked despite the lack of documentation.

Is it expected behavior for Terraform to show `aws_default_subnet` resources as pending creation when running `terraform plan`, and "adopt" them into state only on apply? If so, that could be made clearer in either the plan output, or the documentation, or both. I'd be happy to open a new ticket for that issue if it makes sense, but I wanted clarify the expected behavior first. (Alternatively, please let me know if there's a better forum for this discussion.) Thanks!